import React, { Component } from "react";
import {
  Text,
  StyleSheet,
  View,
  Image,
  Alert,
  TouchableOpacity,
  Button,
  Animated,
  TextInput,
  ImageBackground,
  ScrollView,
} from "react-native";
import { AntDesign } from "@expo/vector-icons";

const Chist = ({ navigation }) => {
  return (
    
    <View
      style={{
        backgroundColor: "#ABFCF7",
        flex: 1,
        borderWidth: 2,
        

        
      }}
    >
    <ScrollView>
    <View style={{paddingBottom: 35}}>
    <ImageBackground source={{ uri: "https://1.bp.blogspot.com/-C0G4_xN-DT0/X1aanENjIzI/AAAAAAAAC-Q/xEOkKLsqkBULmWvpfhNQrC5cs5tF5oSVwCLcBGAsYHQ/s600/%25D9%2582%25D8%25B5%25D8%25A9-%25D9%258A%25D9%2588%25D9%2586%25D8%25B3-%25D9%2585%25D8%25B9%25D8%25AF%25D9%2584.jpg",
  }}
          style={{
              flex: 1,
              height:350,
              width:407, 
          }}
      >
      </ImageBackground>
      </View>
      
      <View >
      <Text style={{paddingLeft:10,paddingRight:10,fontSize:21}}>
      كان سيدنا يونس أو “ذا النون” أو “صاحب الحوت” كما أسماه ربه، كان نبيا كريما صابرا. فقد ظل يدعو قوم “نينوى” فى الموصل بالعراق إلى الإيمان، وكان عددهم أكثر من مائة ألف، ويعبدون صنما ضخما يدعى “عشتار”!!

      ذهب سيدنا يونس عليه لاى قوم نينوى بأمر من الله وظل فيهم يدعوهم لترك عبادة الأصنام وعبادة المولى عز وجل، يقال انه ظل يدعوهم ثلاثا وثلاثين عاما!!
      
      حتى أن سيدنا يونس قد حذر قومه من غضب الله عليهم إذا ظلوا على الكفر. ولكنه أصابه الهم واليأس من قومه لعدم إيمانهم بالله، فخرج من المدينة غاضبا من كفرهم وعنادهم، ولكن خروجه كان بدون صدور الأمر الإلهى له بذلك!!
      
      نسى سيدنا يونس عليه السلام أنه ماعليه سوى الدعوة الى الله، وترك نتيجة دعوته على المولى سبحانه.
      
      توجه يونس إلى مرسى السفن ليركب سفينة ويغادر قومه..
      
      ركب سيدنا يونس عليه السلام السفينة مع الراكبين، وسارت السفينة فى البحر..
      
      حتى إذا ثارت عاصفة هوجاء، وكادت الأمواج أن تغرق السفينة ومن عليها.
      
      وكعادة أهل هذا الزمان فقد ظن ركاب السفينة أن هذه العاصفة سببها أن أحد الركاب قد غضب الله عليه، وقد كان من تقاليدهم فى مثل تلك الأمور أن تجرى قرعة. ومن تقع عليه القرعة، سوف يُلقى من على ظهر السفينة إلى البحر!!
      
      أجرى الركاب القرعة مرة واثنتان وثلاث، وفى كل مرة كان يظهر اسم سيدنا أيوب عليه السلام..
      
      حُسم الأمر وتقرر إلقاء سيدنا يعقوب إلى البحر، علم سيدنا يعقوب أنه أخطأ حينما ترك قومه ورحل غاضبا عنهم، دون أن ينتظر أمر الله، وأدرك أن الله سبحانه وتعالى يعاقبه على فعلته..
      
      أُلقى بالنبى أيوب إلى ظلمات البحر الهائج المضطرب من شدة العاصفة، وكان ليلة ليلاء شديدة الظلام والبرد فيها ينفذ إلى العظام.
      
      فما أن ألقى أيوب إلى الماء، حتى ابتلعه أحد الحيتان العظيمة بأمر من الله عز وجل..
      
      فإذا بسيدنا أيوب عليه السلام فى بطن الحوت محاصرا بثلاث ظلمات.. ظلمة جوف الحوت، وظلمة قاع البحر، وظلمة الليل.
      
      بدأ سيدنا يوسف البكاء والتسبيح والدعاء إلى الله، فما سكت لسانه عن التضرع إلى الله طوال فترة مكوثه فى بطن الحوت.. “لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ”
      
      تعب الحوت ن السباحة واستقر فى قاع البحر ونام، ولم يتوقف سيدنا أيوب عليه السلام عن التسبيح..
      
      واستيقظ الحوت من صوت التسبيح وكانت كل مخلوقات البحر مجتمعة حوله تردد تسبيح أيوب!!
      
      كان الله بلا شك مطلعا على حال أيوب وصدق توبته، فأمر سبحانه الحوت أن يصعد إلى سطح البحر، ويقذف بسيدنا أيوب عليه السلام إلى جزيرة حددها له الله..
      
      حينما خرج سيدنا أيوب من بطن الحوت، كان جلده ملتهبا التهابا شديدا من قوة الأحماض الهاضمة فى معدة الحوت، وقد اشتد به الألم والمرض.
      
      وما أن طلعت عليه الشمس حتى كاد يصرخ من ألم احتراق جلده، فلطف به ربه عز وجل، وأنبت الله فوق نبيه أيوب شجرة كبيرة، ذات أوراق عريضة لتحميه من الشمس..
      
      عفا الله عن نبيه أيوب وشفاه، وأفهمه أن مانجاه حقا هو تسبيحه وايمانه، وأن لو لم يسبح، لأبقاه الله فى بطن الحوت إلى يوم القيامة..
      </Text>
      </View>
      

     

      <View style={{ paddingBottom:211 }}>
        <TouchableOpacity
          onPress={() => navigation.navigate("الرئيسية")}
          style={{
            width: 320,
            backgroundColor: "#52FFF5",
            top: 213,
            height: 50,
            borderTopLeftRadius: 80,
            borderTopRightRadius: 80,
            borderWidth: 5,
            left: 40,
            alignItems: "center",
            justifyContent: "center",
          }}
        >
          <AntDesign
            name="home"
            size={24}
            color="black"
            style={{ right: 115, bottom: -13 }}
          />
          <Text
            style={{
              fontSize: 17,
              color: "black",
              textAlign: "center",
              top: -10,
            }}
          >
            العودة الى الصفحة الرئيسية
          </Text>
        </TouchableOpacity>
      </View>
      </ScrollView>
    </View>
  );
};

export default Chist;

const styles = StyleSheet.create({
  input: {
    width: "100%",
    height: 44,
    backgroundColor: "red",
    borderRadius: 6,
    paddingHorizontal: 10,
  },
});