import React, { Component } from "react";
import {
  Text,
  StyleSheet,
  View,
  Image,
  Alert,
  TouchableOpacity,
  Button,
  Animated,
  TextInput,
  ImageBackground,
  ScrollView,
} from "react-native";
import { AntDesign } from "@expo/vector-icons";

const Dhist = ({ navigation }) => {
  return (
    
    <View
      style={{
        backgroundColor: "#ABFCF7",
        flex: 1,
        borderWidth: 2,
      }}
    >
    <ScrollView>
    <View style={{paddingBottom: 35}}>
    <ImageBackground source={{ uri: "https://i.ytimg.com/vi/xd864y2h05I/maxresdefault.jpg",
  }}
          style={{
              flex: 1,
              height:240,
              width:407, 
          }}
      >
      </ImageBackground>
      </View>
      
      <View >
      <Text style={{paddingLeft:10,paddingRight:10,fontSize:21}}>
      بعد سنوات وسنوات من موت سيدنا آدم..
عاش خمسة رجال صالحين يدعون:(ود)، (سواع)، (يعوق)، (نسر)، (يغوث)..
لم يكن هؤلا الرجال أنبياء ولكنهم كانوا يدعون إلى الله وعبادته..
فأحبهم الناس وبجلوهم وكانت لهم مكانة عظيمة بينهم..

ولما ماتوا صنع لهم الناس تماثيل تكريما لهم ..
ثم مات صانعوا التماثيل ومات أبناؤهم وأحفادهم وهكذا..
حتى جاء جيل من الأحفاد لايعرفون لمن هذه التماثيل ولم صنعت، ولكنهم عرفوا أن من قبلهم بجلوها وعظموها..
فلعب ابليس لعبته مرة ثانية وأقنع الناس أن هذه تماثيل الآلهة!!
وفعلا عبدها الناس وسجدوا لها وتركوا عبادة الحى القيوم..


هنا كان لابد من إرسال نبى يعلم الناس عبادة الله ويرشدهم الى الطريق الصحيح من جديد..
وقد كان سيدنا نوح عليه السلام إنسانا عظيما.
هو لم يكن الأغنى ولا الأقوى ولم يكن ملكا ولا زعيم قومه، ولكنه كان أطهرهم قلبا وأنقاهم نفسا..
والأهم من هذا كله : “إِنَّهُ كَانَ عَبْدًا شَكُورًا”

وخرج نوح إلى قومه يدعوهم إلى عباده الله قائلا: “اعبدوا الله مالكم من إله غيره.. إنى أخاف عليكم عذاب يوم عظيم”
شرح نوح لقومه حقيقة التماثيل التى كانوا يعبدونها، وأن الله هو خالقهم وأن الشيطان هو عدوهم..
استمع قوم نوح لما يقوله، وقد كان كلامه صدمة بالنسبة للكثير منهم، خاصة الإغنياء وعلية القوم والمتربحين من صناعة وعبادة الأصنام، وقد كانوا يفضلون بقاء الأوضاع كما هى عليه: “قَالَ الْمَلأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ مَا نَرَاكَ إِلا بَشَرًا مِثْلَنَا”
وهذ ما أكده نوح منذ البداية، ولكنهم اختاروا ان يستمروا بحججهم الواهية للطعن فى مصداقية سيدنا نوح عليه السلام، فقالو لنوح أن دليل كذبه أنه لم يتبعه ويصدقه سوى الفقراء والضعفاء والأراذل..
فرد نوح: “لقد آمنوا بالله، والله أعلم بما فى أنفسهم”
واستمر قوم نوح فى المماطلة واشترطوا عليه أن يطرد الفقراء من الذين آمنوا به، حتى يؤمنوا هم برسالته وينضموا له!!
وطالت النقاشات و الجدالات بين نوح وقومه، حتى استهلكوا كل الحجج: “قَالَ الْمَلَأُ مِن قَوْمِهِ إِنَّا لَنَرَاكَ فِي ضَلَالٍ مُّبِينٍ”

فما كان من نبى الله نوح إلا أن يقول: “قَالَ يَا قَوْمِ لَيْسَ بِي ضَلَالَةٌ وَلَٰكِنِّي رَسُولٌ مِّن رَّبِّ الْعَالَمِينَ (61) أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنصَحُ لَكُمْ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ”


لم ييأس نوح، وظل يدعو قومه تسعمائة وخمسين عاما دون كلل ودون نتيجة..

وكان كلما تحدث نوح إلى قومه ليدعوهم، جعلوا أصابعهم فى أذانهم لا يريدون أن يستمعوا إلى دعوته، وفروا منه!

ورغم أن عدد المؤمنين المصدقين فى رسالة النبى الكريم ظل ثابتا، بينما تزداد أعداد الكفار ويزداد بطشهم، فلم ييأس سيدنا نوح واستمر فى دعوته لهم، رغم احساسه بالحزن والشفقة عليهم لاختيارهم الكفر على الايمان.

ولكن الله أمر نوح ألا يشعر بالشفقة عليهم وألا يحزن، فدعى نوح على الظالمين من قومه بالهلاك، وقد كان واستاب الله لدعوة نبيه نوح عليه السلام..


أمر الله نوح أن يزرع شجرا، فزرعه وانتظره ينموا لسنوات حتى كبر الشجر..

ثم أمره الله أن يبدأ فى النجارة وتقطيع الأشجار، حتى يصنع منها سفينة ضخمة..

واستمرت صناعة سفينة نوح سنين طوال..

وكان كلما رآه أحدا من قومه وهو يقوم بصنع السفينة سخر منه، فلم يكن هناك أى بحار ولا أنهار مجاورة ولاحتى قريبة من مكان عيشهم

” وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَأٌ مِّن قَوْمِهِ سَخِرُوا مِنْهُ ۚ “

فيمر قومه عليه ويسألوه عما إذا كان سيسير سفينته على الرمال، ثم يضحكوا ويتهمونه بالجنون ثم يتركوه..

حتى إذا انتهى نوح من بناء السفينة، حل أمر الله على القوم الكافرين، وبدأ الطوفان بالخروج أول شئ من الفرن الكائن فى داخل بيت سيدنا نوح.

“حَتَّىٰ إِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ”

كانت سفينة نوح عظيمة البنيان، تتكون من ثلاث طوابق، السفلى وبها أقفاصا للوحوش والحيوانات المختلفة، والطبقة الوسطى للمؤمنين من البشر، والطبقة العليا للطيور بأنواعها، وكان لها باب عظيم بعرضها وغطاء من أعلاها لحمايتها من مياه الطوفان وقوته، وقد كان نوح قد حمل فى سفينته زوجين من كل الكائنات قائلا: ” ارْكَبُوا فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا ۚ “

بدأ الطوفان بالخروج من كل أنحاء الأرض وبدأت المحنة فى الاشتداد على الكافرين.

ولكن زوجة نوح وابنه لم يكونوا من ركاب السفينة، فهم لم يكونوا مؤمنين، وعندما رأى نوح ابنه قال له: “يَا بُنَيَّ ارْكَب مَّعَنَا وَلَا تَكُن مَّعَ الْكَافِرِينَ ” ،فقد طلب نوح من ابنه أن يؤمن بالله حتى يستطيع ان يركب السفينة وينجو من هذا الكرب العظيم، ولكن ابنه رفض  قائلا: ” سَآوِي إِلَىٰ جَبَلٍ يَعْصِمُنِي مِنَ الْمَاءِ ۚ “ ظنا منه أنه يستطيع النجاة اذا وقف فى مكان عالى كالجبل، فقال له أبيه نبى الله نوح: “لَا عَاصِمَ الْيَوْمَ مِنْ أَمْرِ اللَّهِ إِلَّا مَن رَّحِمَ ۚ”، ثم جائت موجة هائلة من الطوفان، “وَحَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِينَ”، وهلك ابن سيدنا نوح..

وبدأ الطوفان يشتد، ووصلت المياه إلى أعلى الجبال، وكان الامواج كالجبال عاتية ومخيفة، وظل سيدنا نوح ومن معه من المؤمنين على السفينة يصلون ويسبحون لله، حتى صدر أمر الله إلى السماء أن تكف أمطارها، وإلى الأرض أن توقف تدفق الماء منها “وَقِيلَ يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ ۖ وَقِيلَ بُعْدًا لِّلْقَوْمِ الظَّالِمِينَ”.

بعدما انتهى الطوفان، لم يتمالك سيدنا نوح نفسه من الجزن على ابنه الذى هلك على الكفر، فناجى ربه طالبا له الرحمة والمغفرة “وَنَادَىٰ نُوحٌ رَّبَّهُ فَقَالَ رَبِّ إِنَّ ابْنِي مِنْ أَهْلِي وَإِنَّ وَعْدَكَ الْحَقُّ وَأَنتَ أَحْكَمُ الْحَاكِمِينَ”

ولكن الله سبحانه عاتب سيدنا نوح “قَالَ يَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ ۖ فَلَا تَسْأَلْنِ مَا لَيْسَ لَكَ بِهِ عِلْمٌ ۖ إِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ”، فليست صلة الدم هى الأقوى والأحق بالرابط بين البشر، ولكن أهم مايجمع البشر على قلب رجل واحد هى صلة الإيمان بربهم جل وعلى..

فاعتذر نوح لربه على سؤاله “قَالَ رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ”

بعد أن انحسرت مياه الطوفان وهدأت العواصف والأمطار، نزل نوح عليه السلام من السفينة وخر ساجدا لله..

أطلق سيدنا نوح سراح حيوانات ووحوش وطيور السفينة، وأشعل والمؤمنين معه نارا، بعد أن كانوا ممنوعين طوال وجودهم على متن السفينة من اشعالها، خوفا أن تسبب حريقا يمتد بسهولة فى أخشاب السفينة!!

وأخيرا عادت الحياة إلى ألارض، حياة هادئة ليس بها الا من يسبح لله  ويؤمن به ويوحده، ولكن بالطبع لن يستمر هذا إلى الأبد!!

فإبليس وذريته لن يتخلوا عن ثأرهم من بنو آدم، وضعف النفس البشرية بطبعها أيضا لابد أن يلعب دورا فى اختلال الأمور مرة أخرى…
      </Text>
      </View>
      

     

      <View style={{ paddingBottom:211 }}>
        <TouchableOpacity
          onPress={() => navigation.navigate("الرئيسية")}
          style={{
            width: 320,
            backgroundColor: "#52FFF5",
            top: 213,
            height: 50,
            borderTopLeftRadius: 80,
            borderTopRightRadius: 80,
            borderWidth: 5,
            left: 40,
            alignItems: "center",
            justifyContent: "center",
          }}
        >
          <AntDesign
            name="home"
            size={24}
            color="black"
            style={{ right: 115, bottom: -13 }}
          />
          <Text
            style={{
              fontSize: 17,
              color: "black",
              textAlign: "center",
              top: -10,
            }}
          >
            العودة الى الصفحة الرئيسية
          </Text>
        </TouchableOpacity>
      </View>
      </ScrollView>
    </View>
  );
};

export default Dhist;

const styles = StyleSheet.create({
  input: {
    width: "100%",
    height: 44,
    backgroundColor: "red",
    borderRadius: 6,
    paddingHorizontal: 10,
  },
});