import React, { Component } from "react";
import {
  Text,
  StyleSheet,
  View,
  Image,
  Alert,
  TouchableOpacity,
  Button,
  Animated,
  TextInput,
  ImageBackground,
  ScrollView,
} from "react-native";
import { AntDesign } from "@expo/vector-icons";

const Phist = ({ navigation }) => {
  return (
    
    <View
      style={{
        backgroundColor: "#ABFCF7",
        flex: 1,
        borderWidth: 2,
        

        
      }}
    >
    <ScrollView>
    <View style={{paddingBottom: 35}}>
    <ImageBackground source={{ uri: "https://1.bp.blogspot.com/-pRNQjhqMleo/X94NCrtohCI/AAAAAAAAAV8/qekGaUraVqoBUF8TaC6NSpzjzi_brY0pQCNcBGAsYHQ/w640/%25D9%2582%25D8%25B5%25D8%25A9%2B%25D8%25A2%25D8%25AF%25D9%2585%2B%25D8%25B9%25D9%2584%25D9%258A%25D9%2587%2B%25D8%25A7%25D9%2584%25D8%25B3%25D9%2584%25D8%25A7%25D9%2585.jpg",
  }}
          style={{
              flex: 1,
              height:360,
              width:407, 
          }}
      >
      </ImageBackground>
      </View>
      
      <View >
      <Text style={{paddingLeft:10,paddingRight:10,fontSize:21}}>
      فى يوم بعيد جداااااااا وقبل بدء الخلق…
      كان الله.. ولا شئ سوى الله وحده عز وجل له الملك وهو على كل شئ قدير!!
      
      أراد الله سبحانه أن يخلق الدنيا بما فيها، الأرض والشمس والقمر والنجوم..
      
      البحار والانهار والجبال والزهور والحيوانات والاسماك والطيور وكل ذلك فصله تفصيلا!!
      
      فهو الذى اذا اراد شيئا ان يقول له كن فيكون، وقد كان…
      
      فقد أمر الله كل هذه الأشياء والمخلوقات ان تتم تشكيلها و خلقها في ستة أيام فقط، ولكنها ايام تختلف عن ايامنا هذه، فلم تكن هناك شمس ولا قمر ولا ارض حتى ليكون الحساب مثلما نحسب ساعات يومنا الان..
      وبعد تلك الستة أيام ، كان أمر الله قد تم وبالفعل كانت السماوات والارض وما بينهما يسبحون ويسجدون للمولى القدير تبارك وتعالى.
      
      وفى السماء عاشت الملائكة، والملائكة هم جنود الله، خلقهم الله من النور، وكانوا لايعصون الله أبدا.
      
      وفيما بين السماء والأرض عاشت الجن، وقد كان فيهم الطيب الصالح كما كان فيهم ايضا الفاسد العاصى.
      
      أما فى الأرض فقد عاشت حيوانات كثيرة وكائنات منها الكبير والصغير، كانت تفترس بعضها البعض طوال الوقت ولا شي ابدا يحكمهم او يروضها او حتى يتحكم فيهم سوى الغريزة.
      
      ثم قرر الله أمرا آخر وقال جل وعلى: “إنى جاعل فى الأرض خليفة”
      
      
      فما كان من الملائكة الا ان تنظر الى ماتفسده الحيوانات فى الارض من قتل وسفك للدماء، وتعجبوا كونهم يسبحون بحمد الله ويقدسون له فلم الحاجة الى مخلوقات دموية مثل تلك التى فى الارض!!
      
      كانت الملائكة بريئة الفطرة نقية، وكانوا يسألون على سبيل الفهم لا الاستنكار، فلم يكونوا يتصوروا ابدا ان هنا اى غاية اخرى من الخلق الا عبادة الله كما كانوا يفعلوا هم!!
      
      فقالوا لله عز وجل: “أتجعل فيها من يفسد فيها ويسفك الدماء ونحن نسبح بحمدك ونقدس لك”
      فكان رد الله تعالى أنه: “إنى أعلم ما لا تعلمون”
      
      فقد كان الله سبحانه قد قرر خلق البشر وأولهم بالطبع سيدنا آدم عليه السلام، وهو نوع جديد من الخلق ليس فى نقاء الملائكة ولا فى حيلة الجين ولا فى رعونة الحيوان..
      
      فقد كان الكون سيتغير بوجود آدم  وسوف تتحق بخلقه حكمة المعرفة وتعمير الأرض التي اراد الله لآدم ان يسعى لها.
      
      وخلق الله آدم من خليط من تراب الارض، فيه الابيض والاسود والاصفر والاحمر(ولهذا تختلف أشكال وألوان البشر)، ثم مزج الله هذا التراب المختلط بالماء فتحول كالعجين او الصلصال وشكله الله تعالى، ثم نفخ فيه سبحانه من روحه فدبت فيه الحياة، وجمع الله الملائكة والجن جميعا ودعاهم أن يسجدوا لسيدنا آدم سجدة تكريم ليست كسجود العبادة والتعظيم لله وحده.
      
      فما كان منهم جميعا الا ان سجدوا الا ابليس أبى واستكبر أن يسجد لسيدنا آدم، وحين سأله الله: “يا إبليس مامنعك أن تسجد لماخلقت بيدى”
      كان رد إبليس:”أنا خير منه.. خلقتنى من نار وخلقته من طين..”
      
      وهنا كان رد الله عز وجل وعلى حين طرد ابليس من رحمته:”فاخرج منها فإنك رجيم.. وإن عليك لعنتى إلى يوم الدين”
      
      وبالفعل خرج ابليس مطرودا من رحمة الله ولسانه يتوعد لسيدنا آدم  وكل ذريته بأنه سوف يخرجهم أيضا ن رحمة الله ويجعلهم يعصون أمر الله!!
      
      وهكذ ومنذ أولى اللحظات فى حياة سدنا آدم، أدرك أن ابليس هو عدوه الاول والوحيد..
      
      “وعلم آدم الأسماء كلها”
      
      علم الله سبحانه سيدنا ادم الكلام وعلمه اسماء كل شئ، ثم أتى الله بالملائكة وعرض عليهم الاشياء اللتى تعلم ادم اسمائها وقال لهم سبحانه: “أنبئونى بأسماء هؤلاء”
      فقالت الملائكة: “سبحانك.. لاعلم لنا إلا ماعلمتنا.. إنك أنت العليم الحكيم”
      وهنا كان الله يريد أن يوضح للملائكة ويجيبهم على تساؤلهم السابق عن السبب وراء خلق البشر والاجابة هى المعرفة وهى الغاية التى كرم الله آدم بها ومن أجلها!!
      
      فقال الله لآدم: “يا إدم أنبئهم بأسماء هؤلاء”
      وهنا أدرك الملائكة وتبينوا السبب الذى أمرهم الله لأجله السجود لإدم فهوى أكثر حكمة وعلم منهم..
      
      عاش سيدنا آدم فى الجنة وحيدا لايجد من يؤنسه، فالملائكة مشغولون عنه بعبادة الله..
      
      حتى نام فى يوم ولما استيقظ وجد امرأة واقفه تحدق فيه بعينين جميلتين، فسألها من أنت، ومن أين ومتى أتيت إلى هنا!؟
      
      فقالت له حواء أن الله قد خلقها من ضلع ادم أثناء نومه، وأنها خلقت لتؤنس آدم فى وحدته وتكون زوجة له..
      وفعلا عاش آدم وحواء أنقى وأطهر وأسعد أيامهم فى الجنة معا..
      
      كان الله قد أمر سيدنا آدم أن يعيش فى الجنة مع زوجته حواء وأن يأكل ويشرب ويفعل ما يشاء أينما يشاء..
      
      إلا أمرا واحدا فقط حذره الله منه!!
      
      فقد حذرهما الله تعالى قبل دخول الجنة: “لاتقربا هذه الشجرة.. فتكونا من الظالمين”
      
      وهنا لعبت النفس البشرية الضعيفة دورها، أضف لذلك وسوسة ابليس: “وَقَالَ مَا نَهَاكُمَا رَبُّكُمَا عَنْ هَٰذِهِ الشَّجَرَةِ إِلَّا أَن تَكُونَا مَلَكَيْنِ أَوْ تَكُونَا مِنَ الْخَالِدِينَ”
      
      فطمع آدم وحواء وضعفت نفسهم وذاقا من ثمار الشجرة المحرمة..
      
      وما أن تذوقاها حتى أحسا بالخزى والعار مما فعلوا، ووجد آدم جسده وامرأته عاريان فظلا يجمعان أوراق الأشجار حتى يغطيا بها جسدهما ويسترا أنفسهما.
      
      ثم وجد آدم نفسه هو وحواء فى الأرض..
      
      بكى ادم وزوجته وندما على مافعلا وطلبا الرحمة والمغفرة ممن الله فتاب الله عليهم.
      
      ثم بدأت رحلة الشقاء بعيدا عن راحة البال ورغد العيش فى الجنة ونعيمها!!
      
      كان على ادم وزوجته الأن توفير مايحتاجانه هما وأطفالهما بأيديهم، فكان عليهما بناء مسكن وتوفير مأكل ومشرب لتأمين الحياة وحماية أنفسهم من وحوش الأرض..
      
      ولكن الأهم من ذلك والأصعب عليهم وعلى أبنائهم، كان ومازال هو محاربة وساوس إبليس الذى سخر نفسه للانتقام من بنو آدم الذى تسبب فى اخراجه من رحمة الله..
      
      عاش ادم وابنائه فى الارض سنين طويلة
      حتى صار ادم عجوزا جدا، وعندما اقتربت سكرات الموت، جمع آدم أبنائه حوله، ووصاهم بتقوى الله ومحاربة وساوس ابليس ، وقال لهم أنه هو عدوهم الأول فى هذه الدنيا هم وأبنائهم، وأنه لانجاة لهم منه الا بطاعة الله وعبادته.
      
      سلم آدم وجهه لله فتوفاه الله واستقبلته الملائكة فرحين به، عسى الله أن ينجينا من هذه الدنيا ويجمعنا بهم على خير فى الجنة إن شاء الله.
      </Text>
      </View>
      

     

      <View style={{ paddingBottom:211 }}>
        <TouchableOpacity
          onPress={() => navigation.navigate("الرئيسية")}
          style={{
            width: 320,
            backgroundColor: "#52FFF5",
            top: 213,
            height: 50,
            borderTopLeftRadius: 80,
            borderTopRightRadius: 80,
            borderWidth: 5,
            left: 40,
            alignItems: "center",
            justifyContent: "center",
          }}
        >
          <AntDesign
            name="home"
            size={24}
            color="black"
            style={{ right: 115, bottom: -13 }}
          />
          <Text
            style={{
              fontSize: 17,
              color: "black",
              textAlign: "center",
              top: -10,
            }}
          >
            العودة الى الصفحة الرئيسية
          </Text>
        </TouchableOpacity>
      </View>
      </ScrollView>
    </View>
  );
};

export default Phist;

const styles = StyleSheet.create({
  input: {
    width: "100%",
    height: 44,
    backgroundColor: "red",
    borderRadius: 6,
    paddingHorizontal: 10,
  },
});