import React, { Component } from "react";
import {
  Text,
  StyleSheet,
  View,
  Image,
  Alert,
  TouchableOpacity,
  Button,
  Animated,
  TextInput,
  ImageBackground,
  ScrollView,
} from "react-native";
import { AntDesign } from "@expo/vector-icons";

const Qhist = ({ navigation }) => {
  return (
    
    <View
      style={{
        backgroundColor: "#ABFCF7",
        flex: 1,
        borderWidth: 2,
      }}
    >
    <ScrollView>
    <View style={{paddingBottom: 35}}>
    <ImageBackground source={{ uri: "https://1.bp.blogspot.com/-YYa7qP0wwls/X1aJ8iMdF7I/AAAAAAAAC9w/AqNgCI-odL03Z-87TnxIdTc8aaGApe78gCLcBGAsYHQ/s600/%25D8%25B5%25D8%25A7%25D9%2584%25D8%25AD-%25D9%2585%25D8%25B9%25D8%25AF%25D9%2584.jpg",
  }}
          style={{
              flex: 1,
              height:260,
              width:407, 
          }}
      >
      </ImageBackground>
      </View>
      
      <View >
      <Text style={{paddingLeft:10,paddingRight:10,fontSize:21}}>
      وتمر سنين وسنين..

      ومن بعد عاد قوم سيدنا هود، جاء ثمود قوم سيدنا صالح عليه السلام..
      
      “وَتَنْحِتُونَ مِنَ الْجِبَالِ بُيُوتًا فَارِهِينَ”
      
      كان قوم ثمود ينحتون بيوتا شاهقة وعظيمة قى الجبال، وكانوا أقوياء البنية، شديدى القوة، حتى أن الله قد فتح عليهم فى رزقهم وميزهم عن غيرهم كثيرا..
      
      لكن ثمود أيضا كانوا يعبدون الأصنام، فأرسل الله لهم صالح ليدعوهم لعبادة الله الواحد القهار “وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا”
      
      قال لهم سيدنا صالح عليه السلام كما قال الرسل من قبله: ” قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ هُوَ أَنشَأَكُم مِّنَ الْأَرْضِ وَاسْتَعْمَرَكُمْ فِيهَا فَاسْتَغْفِرُوهُ ثُمَّ تُوبُوا إِلَيْهِ ۚ إِنَّ رَبِّي قَرِيبٌ مُّجِيبٌ”
      
      وبالطبع فإن الطغاة أنكروا على صالح دوعوته لله ولاموه عليها إذ كان صالحا معروف عنه التقوى والصدق..
      
      “قَالُوا يَا صَالِحُ قَدْ كُنتَ فِينَا مَرْجُوًّا قَبْلَ هَٰذَا ۖ أَتَنْهَانَا أَن نَّعْبُدَ مَا يَعْبُدُ آبَاؤُنَا وَإِنَّنَا لَفِي شَكٍّ مِّمَّا تَدْعُونَا إِلَيْهِ مُرِيبٍ”
      
      فقد أنكر ظلام عقولهم كيف أن صالح ينهاهم عن عبادة الأصنام التى وجدوا عليها اباؤهم وأجدادهم من قبل!!
      
      وطالب أهل عاد من سيدنا صالح معجزة تثبت لهم أنه بالفعل رسول من الله..
      
      وقد كان لهم ماطلبوه، “وَيَا قَوْمِ هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً”
      
      ف هذه ناقة الله فهى لم تكن ناقة عادية، فقد انشق بطن الجبل وخرجت منه هذه الناقة المعجزة لتبين لهم قدرة الخالق على كل شئ..
      
      ومن آيات اختلاف ناقة صالح هذ ومعجزته عن غيرها أنها:
      
      كانت كل الدواب لاتقترب ابدا من اى بئر تقرر ناقة صالح الشرب منها فى يومها، حتى لايتبقى أى ماء فى البئر ليشرب منه باقى الناس..
      وكانت تدر لبنا فى هذا اليوم يكفى لشرب جميع قوم  ثمود فتعوضهم عما شربته من الماء بلبن..
      وإذا نامت فى مكان تركته لها الحيوانات الأخرى..
      وأصدر سيدنا صالح الأمر إلى قومه بعدم المساس بالناقة المعجزة ” فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ قَرِيبٌ”
      
      وحذرهم بعذاب الله لهم إذا ذبحوها أو أذوها..
      
      بالطبع فى أول أيام بعد حدوث الناقة وخروجها من الجبل بهذا الشكل، كان قوم ثمود منبهرين وفى دهشة من هذه المعجزة العظيمة التى شهدوها، وكيف أن لبنها يكفى ألاف الرجال والنساء والأطفال، فآمن من قوم صالح من آمن، وبقى منهم على الكفر والعناد من بقى..
      
      وعاشت الناقة فى سلام بين قوم ثمود، حتى اجتمع الكافرون من أهل ثمود، وحولوا كراهيتهم لسيدنا صالح ودعوته، إلى كره لتلك الناقة المعجزة، وبدأ التدبير والتآمر للتخلص منها..
      
      وفى اجتماعهم هذا بدأت تلفق المبررات لقتل تلك الناقة العظيمة..
      
      فقال أحد الكافرين: إن الناقة تلجأ الى الوادى البارد فى الحر، فتعل مواشينا نحن تهرب إلى الشمس وتمرض!!
      
      وقال آخر: إن تلك الناقة إذا جاء الشتاء، تلجأ إلى أدفا مكان وتستريح فيه، وتترك المواشى الأخرى منها إلى البرد فتموت!!
      
      وهنا قرر كبير قوم ثمود: أنه إذن فليس هناك حل إلا التخلص من تلك الناقة وذبحها!!
      
      فنبههم أحد الجالسين مذكرا: لقد حذرنا صال من المساس بتلك الناقة !!
      
      وكان رد كبيرهم: أننا لانصدق صالح ومايدعيه من نبوة!!
      
      ووضعوا خطتهم بأن اختاورا تسعة رجال من أقسى وأشد مجرميهم وكلفوهم بقتل ناقة صالح..
      
       
      
      وجاء اليوم الذى اختاروه لقتلها، وبينما كانت الناقة نائمة تحتضن طفلها الصغير، خرج عليها المجرمون التسعة المكلفون بقتلها، وأخرجوا سيوفهم وسهامهم وظلوا يطعنوا فى جسدها، فتنهدت الناقة ثلاث مرات، ثم ماتت، ومات أيضا صغيرها..
      
      وعندما علم سيدنا صالح عليه السلام بماحدث، خرج على قومه يتوعدهم بعذاب شديد من الله جزاء بما صنعوا، وقتلهم الناقة التى نهاهم عنها..
      
      “فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا فِي دَارِكُمْ ثَلَاثَةَ أَيَّامٍ ذَلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ”
      
      وتركهم صالح ومن آمن معه من قومه ومضى بعيدا..
      
      وبعد مرور الثلاثة أيام( مثلما تنهدت الناقة ثلاث قبل موتها)، وكان ثمود قوم صالح مازالون يسخرون من وعده لهم، وقد نوا أنهم نجوا بفعلتهم..
      
      وفى فجر اليوم الرابع، انشقت السماء عن صيحة واحدة جبارة..
      
      تلك الصيحة كانت كفيلة بالقضاء على قوم ثمود وتدمير بيوتهم، فقد سوت الأرض بالجبال، وانهد كل شئ قد كان يدل يوما على أن قوما قد عاشوا هنا..
      
      “وَأَخَذَ الَّذِينَ ظَلَمُوا الصَّيْحَةُ فَأَصْبَحُوا فِي دِيَارِهِمْ جَاثِمِينَ ..كَأَنْ لَمْ يَغْنَوْا فِيهَا أَلَا إِنَّ ثَمُودَ كَفَرُوا رَبَّهُمْ أَلَا بُعْدًا لِثَمُودَ”
      
      وانتهت قصة سيدنا صالح، بهلاك المجرمين ونجاة المؤمنين وسيدنا صالح، وانطوت صفحة قوم ثمود الظالمين للأبد..
      </Text>
      </View>
      

     

      <View style={{ paddingBottom:211 }}>
        <TouchableOpacity
          onPress={() => navigation.navigate("الرئيسية")}
          style={{
            width: 320,
            backgroundColor: "#52FFF5",
            top: 213,
            height: 50,
            borderTopLeftRadius: 80,
            borderTopRightRadius: 80,
            borderWidth: 5,
            left: 40,
            alignItems: "center",
            justifyContent: "center",
          }}
        >
          <AntDesign
            name="home"
            size={24}
            color="black"
            style={{ right: 115, bottom: -13 }}
          />
          <Text
            style={{
              fontSize: 17,
              color: "black",
              textAlign: "center",
              top: -10,
            }}
          >
            العودة الى الصفحة الرئيسية
          </Text>
        </TouchableOpacity>
      </View>
      </ScrollView>
    </View>
  );
};

export default Qhist;

const styles = StyleSheet.create({
  input: {
    width: "100%",
    height: 44,
    backgroundColor: "red",
    borderRadius: 6,
    paddingHorizontal: 10,
  },
});