import React, { Component } from "react";
import {
  Text,
  StyleSheet,
  View,
  Image,
  Alert,
  TouchableOpacity,
  Button,
  Animated,
  TextInput,
  ImageBackground,
  ScrollView,
} from "react-native";
import { AntDesign } from "@expo/vector-icons";

const Shist = ({ navigation }) => {
  return (
    
    <View
      style={{
        backgroundColor: "#ABFCF7",
        flex: 1,
        borderWidth: 2,
        

        
      }}
    >
    <ScrollView>
    <View style={{paddingBottom: 35}}>
    <ImageBackground source={{ uri: "https://wikiforschool.com/ad/uploads/848458hqdefault.jpg",
  }}
          style={{
              flex: 1,
              height:360,
              width:407, 
          }}
      >
      </ImageBackground>
      </View>
      
      <View >
      <Text style={{paddingLeft:10,paddingRight:10,fontSize:21}}>
      ولد رسول الله – صلى الله عليه وسلم – في مكة ، وهي وطنه ووطن آبائه ، وكان أهلها يعبدون الأصنام ، ويعيشون حياة جاهلية ، لا يرضاها الله تعالى ، فيها الوثنية ، وفيها الجهل ، وفيها الظلم …

فبعث الله رسوله ، وهو في سن الأربعين ، وأنزل عليه الوحي ، وأمره بالدعوة إلى التوحيد ، والدين الخالص ، وفضائل الأعمال ، فعاداه أهل مكة ، حتى ضاقت الأرض على هذه الدعوة ، وهذه العقيدة ، وتنكر أهلها لهما .

وأمر رسول الله – صلى الله عليه وسلم – بالهجرة إلى المدينة ، فخرج هو وصاحبه أبو بكر – رضي الله عنه – من مكة مُستخفيين ، واقتفى المشركون أثر النبي الكريم ، ووصلا في طريقهما إلى غار ثور – وهو على جبل بين مكة والمدينة – ودخلا الغار .

وبعث الله العنكبوت فنسجت ما بين الغار والشجرة التي كانت على وجه الغار ، وسترت رسول الله – عليه الصلاة والسلام – وأبا بكر ، وأمر الله حمامتين فأقبلتا حتى وقعتا بين العنكبوت وبين الشجرة .

ووصل الباحثون إلى فم الغار ، ولم يبق بينهم وبين معرفتهم إلا أن ينظر أحدهم إلى تحت قدميه ، ولكن الله حال بينهم وبين ذلك ، فاختلط عليهم الأمر ، ورأوا على باب الغار نسج العنكبوت ، وكيف يدخل أحد الغار ، ولا يقطع نسج العنكبوت ، ويبقى على حاله !

وبينما هما في الغار إذ رأى أبو بكر آثار المشركين ، فقال : يا رسول الله ، لو أن أحدهم رفع قدمه رآنا .

قال رسول الله – صلى الله عليه وسلم – : ” ما ظنك باثنين الله ثالثهما ” وفي ذلك يقول تعالى :

” ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ” ( التوبة 40 ) .

واختلط على الباحثين والمتفحصين الأمر ، وانصرفوا خائبين 
وأقام رسول الله – صلى الله عليه وسلم – بالمدينة ، وبدأت دعوة الإسلام تنتشر والناس يدخلون في دين الله ، وبقيت عداوة قريش والمشركين على حالها ، وبدؤوا يحاربون الإسلام والمسلمين ، والمسلمون يقاومونهم ويقابلون السلاح بالسلاح ، والجيش بالجيش .

وخرج رسول الله صلى الله عليه وسلم في غزوة ورجع عنها في الظهيرة ، وكانت أيام الصيف ، فأراد نبي الرحمة أن يستريح .

وليس في البرية مكان يستريح فيه الإنسان إلا الشجر .

وليس في البرية في بلاد العرب شجر كبير ، وليس فيها إلا السمُر ( شجر فيه شوك ) .

فنزل الرسول الكريم تحت سمرة وعلق بها سيفه ، وتفرق الناس وناموا ، ونام رسول الله – عليه الصلاة والسلام – تحت السمرة .

وجاء رجل من المشركين وسيف رسول الله – عليه الصلاة والسلام – معلق بالسمرة وهو في غمده .

فأخذ المشرك السيف وسله من غمده ، واستيقظ رسول الله صلى الله عليه وآله وسلم .

فقال المشرك … والسيف مسلول في يده … للرسول الكريم : تخافني ؟

قال رسول الله : لا !

قال المشرك : من يمنعك مني ؟

قال حبيب الله : الله .

فسقط السيف من يد المشرك ، فأخذ رسول الله – عليه الصلاة والسلام – السيف ، وقال للمشرك : من يمنعك مني ؟ 

فقال المشرك : كن خير آخذ !

فقال الرسول الكريم : أتشهد أن لا إله إلا الله وأني رسول الله .

قال المشرك : لا ! ولكني أعاهدك على أن لا أقاتلك ولا أكون مع قوم يقاتلونك .

فخلى رسول الله – صلى الله عليه وسلم – سبيله .

فأتى المشرك أصحابه فقال : جئتكم من عند خير الناس
لما دعا رسول الله صلى الله عليه وسلم الناس إلى الله في مكة ، غضبت قريش وكانت تعبد الأصنام وتجلها ، وتتقرب إليها بالقرابين ، فتعرضوا للرسول بالأذى ، وعذبوا المسلمين ، فصبروا وثبتوا على دين الحق .

ولكن قريشا كانوا يمنعون الناس عن الإسلام ويحولون بين المسلمين وعبادة الله ، فإذن الله لنبيه بالهجرة ، فهاجر إلى المدينة ، وهاجر المسلمون ، وكانت المدينة أرضا طيبة للإسلام ، في أهلها لين ورقة ، قد أسلم منهم كثير قبل الهجرة .

ولما انتقل النبي الكريم من مكة إلى المدينة وسكن هنالك أحب أن يبني مسجدا ، لأن المسجد لازم للمسلمين ، وهو قطب تدور حوله رحى الحياة الإسلامية .

وكان النبي نازلا في بيت أبي أيوب الأنصاري – رضي الله عنه – وكان ضيفا عليه ، وكان قريبا من بيته مربد ، فأراد الرسول أن يبني المسجد في ذلك المكان ، فقال : لمن هذا المربد ؟
قال رجل من الأنصار اسمه معاذ بن عفراء : هو يا رسول الله ! ليتيمين ، اسم أحدهما سهل ، واسم الثاني سهيل .

فطلب الرسول سهلا وسهيلا ، وهما ولدان يتيمان ، فلما حضرا ، كلمهما النبي الكريم في أمر المربد وثمنه .

قال سهل وسهيل : هو – يا رسول الله – لله ، لا نشتري به ثمنا ، فابن المسجد ، وقد طابت به أنفسنا ، ولكن رسول الله صلى الله عليه وسلم أبى ، واشترى منهما المكان ، ودفع الثمن .

وبنى المسلمون المسجد ، والرسول يعمل بيده وينقل اللبِن ، فقال قائل من المسلمين : 

لئن قعدنا والنبي يعمل *  لذاك منا العمل المضلل

وكان المسلمون يبنونه ويقولون :

اللهم لا عيش إلا عيش الآخره  *  فارحم الأنصار والمهاجره
مرت سنوات الدعوة بغزواتها وانتصاراتها وبكل مافيها، حتى أتى يوم لم يعد الرسول صلى الله عليه وسلم يلاعب الأطفال كما تعود. وطلبت أمنا عائشة رضى الله عنها وأرضاها، للأطفال المتصايحين خارج منزل الرسول صلى الله عليه سلم، طلبت منهم أن يهدأوا فإن رسول الله مريض..

وفى يوم الاثنين الثاني عشر من ربيع الأول من السنة الحادية عشرة للهجرة.

 وقد حكى أنس عن ذلك اليوم فقال: بينما هم في صلاة الفجر يوم الاثنين وأبو بكر يصلي بهم لم يفجأهم إلا رسول الله صلى الله عليه وسلم كشف ستر حجرة عائشة فنظر إليهم وهم في صفوف الصلاة، ثم تبسم يضحك، فنكص أبو بكر على عقبيه ليصل الصف وظن أن رسول الله صلى الله عليه وسلم يريد أن يخرج إلى الصلاة، فقال أنس وهمَّ المسلمون أن يفتتنوا في صلاتهم، فرحاً برسول الله صلى الله عليه وسلم، فأشار إليهم بيده رسول الله صلى الله عليه وسلم أن أتموا صلاتكم ثم دخل الحجرة وأرخى الستر. رواه البخاري. 

      </Text>
      </View>
      

     

      <View style={{ paddingBottom:211 }}>
        <TouchableOpacity
          onPress={() => navigation.navigate("الرئيسية")}
          style={{
            width: 320,
            backgroundColor: "#52FFF5",
            top: 213,
            height: 50,
            borderTopLeftRadius: 80,
            borderTopRightRadius: 80,
            borderWidth: 5,
            left: 40,
            alignItems: "center",
            justifyContent: "center",
          }}
        >
          <AntDesign
            name="home"
            size={24}
            color="black"
            style={{ right: 115, bottom: -13 }}
          />
          <Text
            style={{
              fontSize: 17,
              color: "black",
              textAlign: "center",
              top: -10,
            }}
          >
            العودة الى الصفحة الرئيسية
          </Text>
        </TouchableOpacity>
      </View>
      </ScrollView>
    </View>
  );
};

export default Shist;

const styles = StyleSheet.create({
  input: {
    width: "100%",
    height: 44,
    backgroundColor: "red",
    borderRadius: 6,
    paddingHorizontal: 10,
  },
});