import React, { Component } from "react";
import {
  Text,
  StyleSheet,
  View,
  Image,
  Alert,
  TouchableOpacity,
  Button,
  Animated,
  TextInput,
  ImageBackground,
  ScrollView,
} from "react-native";
import { AntDesign } from "@expo/vector-icons";

const Thist = ({ navigation }) => {
  return (
    
    <View
      style={{
        backgroundColor: "#ABFCF7",
        flex: 1,
        borderWidth: 2,
      }}
    >
    <ScrollView>
    <View style={{paddingBottom: 35}}>
    <ImageBackground source={{ uri: "https://1.bp.blogspot.com/-AcuqchjB9lE/V1I0VwaJdAI/AAAAAAAABeQ/7YASsXuXIQwKieFXR7vf3d7aTia_TqEjgCLcB/s1600/13340947_627236637432168_1992155172_o.png",
  }}
          style={{
              flex: 1,
              height:240,
              width:407, 
          }}
      >
      </ImageBackground>
      </View>
      
      <View >
      <Text style={{paddingLeft:10,paddingRight:10,fontSize:21}}>
      بعد موت سيدنا نوح ،قام ابليس بنفس الخدعة القديمة، فجعل قوم نوح يصنعون وأحفادهم من بعد الطوفان يصنعون تماثيلا للمؤمنين من أهل سفينة نوح تكريما لهم ولقدرهم..

      مرت سنوات وسنوات…
      مات الآباء والابناء والاحفاد، وجاء أحفاد الأحفاد، ووتكرر الأمر، فقد نسى الناس وصية أنبياء الله لهم من قبل بعبادة الله وحده لاشريك له وتوحيده..
      
      وإذا الناس الان نسوا ماذكروا به، وعادوا الى عبادة الأصنام، وانتشر على إثر ذلك الظلم والفساد فى الأرض..
      
      وكان ميعاد الله بإرسال سيدنا هود عليه السلام إلى قومه لدعوتهم الى العودة الى الطريق الصحيح!!
      
      كان سيدنا هود من قبيلة تسمى “عاد”، وكانوا يعيشون فى صحراء تطل على البحر تسمى “الأحقاف”..
      كانوا يصنعون بيتوا من خيام عظيمة، لها أعمدة شديدة الضخامة والارتفاع..
      
      وكانت أجسام قوم عاد شديدة الضخمة، فقد كانوا أعظم وأضخم أهل هذا الزمان فى القوة والشدة والطول، حتى اغتروا بقدر نفسهم حين قالوا فيما بعد: “فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً ۖ”، وبرغم شدتهم وقوة أجسامهم، فقد كانت عقولهم مليئة بظلام الكفر، وإنكار الحق مهما كان بينا جليا..
      
      بدأ سيدنا هود عليه السلام يدعوهم ويبين لهم ماهم فيه من كفر إلى الله تعالى: “وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا ۚ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ إِنْ أَنتُمْ إِلَّا مُفْتَرُونَ”..
      
      هى نفس دعوة كل الرسل من قبل ومن بعد، ثابتة لاتتغير، هى كلمة الحق، ونفس الرد أيضا يتكرر من القوم المشركين..
      
      اتهم قوم هود نبى الله بأنه يدعوهم فقط لكى يكون سيدا عليهم، وأنه فقط يدعوهم لما سوف يعود عليه من منافع قيادة قوم عظام شداد مثلهم!!
      
      فما كان من سيدنا هود إلا أن قال: ” يَا قَوْمِ لَا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا ۖ إِنْ أَجْرِيَ إِلَّا عَلَى الَّذِي فَطَرَنِي ۚ أَفَلَا تَعْقِلُونَ”
      
      فأنا لاأريد أجرا إلا أن تهتدوا، وحاول النبى الكريم أن يذكرهم بنعم الله وفضله العظيم سبحانه عليهم، وبثوابه لهم وفضله إذا عادوا للايمان..
      
      واستمر جدال القوم المشركين بلاطائل، فكانوا يكيلون التهم الى سيدنا هود، ويكذبون رسالته، ويحاولون تفسير سبب دعوته لهم، فقالوا: “إِن نَّقُولُ إِلَّا اعْتَرَاكَ بَعْضُ آلِهَتِنَا بِسُوءٍ ۗ”، ظنا منهم ومن ظلام عقولهم أن آلهتهم قد أصابت هود بالجنون والخبل انتقاما منها لصدهم عن عبادتها!!
      
      وقد كان قوم هود قد غرتهم شدتهم وقوة أجسامهم وظنوا أن لن يقدر عليهم أحد..
      
      فكلما جاءهم هود يدعوهم إلى رحمة الله، ويخوفهم بطشه، كالوا له التهم بالكذب، واستمروا فى إنكار رسالته..
      
      وقد توهموا أنه إذا جاء أمر الله فإن أصنامهم التى يعبدونها هى من سينقذهم!!
      
      ظل هودا يدعو أهل عاد سنينا، وكلما دعاهم، كلما ازداد بطشهم وظلمهم، إلى أن تحدى قوم عاد سيدنا هود أن يدعو ربه أن يهلكهم، “ أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً ۖ وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ”.
      
      وانتظر هود وقومه وعد الله بهلاكهم..
      
      وبدأت الأرض تجف، ولم تمطر السماء لوقت طويل جدا..
      
      وألهبت الشمس رمال الصحراء، وكأن الشمس كانت فوق رؤوسهم من شدة الحر..
      
      وهنا خاف أهل عاد وجاءوا  الى هود عليه السلام يسألونه عن سبب هذا الذى يحدث!!
      
      فما كان من نبى الله إلا أن يدعوهم مرة أخرى ألى رحمة من الل إذا آمنوا فقال هود: “يَا قَوْمِ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا وَيَزِدْكُمْ قُوَّةً إِلَىٰ قُوَّتِكُمْ وَلَا تَتَوَلَّوْا مُجْرِمِينَ”
      
       ورغم كل مارأوا من بشريات الهلاك والعذا فما كان من قوم هود إلا أن يقولوا: ” يَا هُودُ مَا جِئْتَنَا بِبَيِّنَةٍ وَمَا نَحْنُ بِتَارِكِي آلِهَتِنَا عَن قَوْلِكَ وَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ “
      
      وسخر قوم هود من دعوته مرة أخرى وتركوه وتولوا عنه!!
      
      زاد الجفاف ومات الأخضر من الزرع، وإذا فى يوم بسحب عظيمة تملأ السماء، وخرج قوم عاد يحتفلون، ” فَلَمَّا رَأَوْهُ عَارِضًا مُّسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَٰذَا عَارِضٌ مُّمْطِرُنَا”، ظنا منهم بأن آلهتهم قد استجابت لدعائم ونجتهم من الجفاف والهلاك!!
      
      ولكن كان ينتظرهم شيئا آخر فقال لهم هود: “بَلْ هُوَ مَا اسْتَعْجَلْتُم بِهِ ۖ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ “، فهذا هو ماتحديتم به عظمة الله غرورا منكام وظنا أنكم تستطيعون النجاة..
      
      وفجأة.. انقلب الجو!!
      
      بدأت الرياح تشتد، وتحول الجو من الحر الشديد إلى البرد القارس، واهتزت الخيام والأشجار من شدة الرياح، حتى كانت الرياح تخلع عظام قوم هود من شدتها وتقطع جلدهم من برودتها!!
      
      “وَأَمَّا عَادٌ فَأُهْلِكُوا بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ.. سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُومًا فَتَرَى الْقَوْمَ فِيهَا صَرْعَى كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ..فَهَلْ تَرَى لَهُمْ مِنْ بَاقِيَةٍ”
      
      دمرتهم الرياح وقضت على قوم هود، ومانفعهتهم آلهتهم، ولاشدة أجسامهم، ولاجبروتهم وطغيانهم..
      
      هلك الكافرون ونجا هود ومن معه..
      </Text>
      </View>
      

     

      <View style={{ paddingBottom:211 }}>
        <TouchableOpacity
          onPress={() => navigation.navigate("الرئيسية")}
          style={{
            width: 320,
            backgroundColor: "#52FFF5",
            top: 213,
            height: 50,
            borderTopLeftRadius: 80,
            borderTopRightRadius: 80,
            borderWidth: 5,
            left: 40,
            alignItems: "center",
            justifyContent: "center",
          }}
        >
          <AntDesign
            name="home"
            size={24}
            color="black"
            style={{ right: 115, bottom: -13 }}
          />
          <Text
            style={{
              fontSize: 17,
              color: "black",
              textAlign: "center",
              top: -10,
            }}
          >
            العودة الى الصفحة الرئيسية
          </Text>
        </TouchableOpacity>
      </View>
      </ScrollView>
    </View>
  );
};

export default Thist;

const styles = StyleSheet.create({
  input: {
    width: "100%",
    height: 44,
    backgroundColor: "red",
    borderRadius: 6,
    paddingHorizontal: 10,
  },
});